Repository: 84000/data-translation-memory
Catalog: toh182-v2.tmx
Source language: bo
Languages: en

source: ལག་མཐིལ་སྦྱིན་པ་ཞེས་བྱ་བ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་ཅན་ཐམས་ཅད་ལ་ཆོས་ཀྱི་ལག་པ་སྦྱིན་པའི་ཚིག་བླ་དགས་ཡིན་གྱིས།
en: ‘Offering one’s hands represents the offering of the bodhisattvas’ Dharma hands to all beings. Therefore,

source: བདག་གིས་ལག་མཐིལ་སྦྱིན་པ་སྦྱིན་པར་བྱ་གོར་མ་ཆག་སྙམ་མོ། །
en: I will definitely practice generosity by offering my hands!’

source: དེ་ལ་ལག་མཐིལ་གྱི་སྦྱིན་པ་དེ་སྦྱིན་པ་ན།
en: When practicing generosity by offering their hands,

source: དེ་བཞིན་གཤེགས་པས་རྣམ་པར་མཁྱེན་པའི་སྨོན་ལམ་བཞིན་དུ་ལག་མཐིལ་སྦྱིན་པ་འདིས་ན།
en: ‘In accordance with the aspirations known to the thus-gone ones, through this offering of my hands

source: བདག་སེམས་ཅན་དམན་པ་དང་། ལོང་བ་དང་། བཀྲེན་པ་དང་། མགོན་མེད་པ་དང་། སྡུག་བསྔལ་བ་དང་། དབུལ་པོ་དང་། གནས་མེད་པ་དང་། སྐྱབས་མེད་པ་དང་། དཔུང་གཉེན་མེད་པ་རྣམས་དང་། སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དང་། ངན་སོང་ངན་འགྲོ་ལོག་པར་ལྟུང་བ་དང་། མི་ཁོམ་པར་སྐྱེས་པ་རྣམས་ལ་ཆོས་ཀྱི་ལག་པ་སྦྱིན་པར་བྱེད་པར་གྱུར་ཅིག་
en: may I offer the hands of the Dharma to those who have an inferior status—those who are blind, indigent, unprotected, miserable, poor, homeless, defenseless, or helpless; to those who have fallen into the lower realms of hell, the animal realms, or the world of Yama; and to all those who are born in unfree states!’

source: ལག་མཐིལ་སྦྱིན་པས་མྱུར་དུ་བདག །རྣམ་འདྲེན་ལག་ན་རིན་ཆེན་དང་། །ལག་པ་རིང་ཞིང་གསེར་མདོག་ལྡན། །འཇིག་རྟེན་མཆོད་གནས་གྱུར་པར་ཤོག །
en: “Through this offering of my hands, May I swiftly become an object of worship for the world, A great guide with long hands holding jewels, And possessing a golden complexion!

source: སྙིང་རྗེས་ནོན་པར་གྱུར་ནས་ནི། །ཆོས་ཀྱི་ལག་པ་བསྟོད་བྱས་ལ། །ངན་སོང་ཀུན་ལས་ལུས་ཅན་རྣམས། །བདག་གིས་རྟག་ཏུ་འབྱིན་པར་ཤོག །
en: “With the lauded hands of the Dharma Pressed together out of compassion, May I forever deliver All beings from all lower realms!

source: དེ་ལ་རྣ་བ་དང་སྣ་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་ལ་ཇི་ལྟར་མངོན་པར་བརྩོན་པར་བྱེད་ཅེ་ན།
en: “How do bodhisattvas exert themselves in the practice of generosity by giving away their ears and noses?

source: རྣ་བ་དང་སྣ་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་ཞེས་བྱ་བ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དབང་པོ་ཚང་བ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བའི་ཚིག་བླ་དགས་ཡིན་གྱིས།
en: ‘Giving away one’s ears and nose represents the bodhisattvas’ perfection of unimpaired sense faculties. Therefore,

source: བདག་གིས་རྣ་བ་དང་། སྣ་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་སྦྱིན་པར་བྱ་གོར་མ་ཆག་སྙམ་མོ། །
en: I will definitely practice generosity by giving away my ears and nose!’

source: དེ་རྣ་བ་དང་སྣ་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་དེ་སྦྱིན་པ་ན།
en: When practicing generosity by giving away their ears and noses,

source: དེ་བཞིན་གཤེགས་པས་རྣམ་པར་གཞག་པའི་སྨོན་ལམ་བཞིན་དུ། རྣ་བ་དང་སྣ་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་འདིས་ན།
en: ‘In accordance with the aspirations made by the thus-gone ones, through this gift of my ears and nose

source: བདག་སེམས་ཅན་ཐམས་ཅད་དབང་པོ་ཐམས་ཅད་དང་ལྡན་པར་བྱེད་པར་གྱུར་ཅིག་
en: may I cause all beings to be endowed with a full set of unimpaired sense faculties!’

source: རྣ་བ་དང་ནི་སྣ་བཏང་བས། །སྲོག་ཆགས་རྣམས་ནི་ཐམས་ཅད་ཀྱང་། །དབང་པོ་ཀུན་དང་ལྡན་གྱུར་ཏེ། །ཡན་ལག་ཐམས་ཅད་རྫོགས་པར་ཤོག །
en: “Through this gift of my ears and nose, May all beings be endowed With a full set of sense faculties And with unimpaired physical limbs!

source: རྣ་བ་དང་ནི་སྣ་བཏང་བས། གང་དང་གང་དུ་སྐྱེས་པ་དེར། །བལྟ་ན་སྡུག་ཅིང་གཟུགས་བཟང་ལ། །མི་ནི་དེ་བཞིན་མཛེས་པར་འགྱུར། །
en: “Those who give away their ears and noses, Wherever they are born, Will always have an attractive appearance And enjoy pleasant and beautiful physiques.

source: དེ་ལ་མིག་གི་སྦྱིན་པ་ལ་ཇི་ལྟར་མངོན་པར་བརྩོན་པར་བྱེད་ཅེ་ན།
en: “How do bodhisattvas exert themselves in the practice of generosity by offering their eyes?

source: མིག་སྦྱིན་པ་ཞེས་བྱ་བ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཆོས་ཀྱི་མིག་སྒྲིབ་པ་མེད་པ་ཡོངས་སུ་དག་པའི་ཚིག་བླ་དགས་ཡིན་གྱིས།
en: ‘Offering one’s eyes represents the bodhisattvas’ purification of the stainless eye of Dharma. Therefore,

source: བདག་གིས་མིག་གི་སྦྱིན་པ་སྦྱིན་པར་བྱ་གོར་མ་ཆག་སྙམ་མོ། །
en: I will definitely practice generosity by offering my eyes!’

source: དེ་མིག་གི་སྦྱིན་པ་དེ་སྦྱིན་པ་ན།
en: When practicing generosity by offering their eyes,

source: དེ་བཞིན་གཤེགས་པས་དག་པར་མཛད་པའི་སྨོན་ལམ་བཞིན་དུ། མིག་གི་སྦྱིན་པ་འདིས་ན།
en: ‘In accordance with the aspirations purified by the thus-gone ones, through this offering of my eyes

source: བདག་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་མིག་སྒྲིབ་པ་མེད་པ་ཡོངས་སུ་དག་པར་བྱེད་པར་གྱུར་ཅིག་
en: may I cause all beings to purify the stainless eye of Dharma!’

source: མིག་གི་སྦྱིན་པ་འདིས་ན་
en: “Through this offering of my eyes,

source: བདག །བླ་མེད་བྱང་ཆུབ་སངས་རྒྱས་ནས། །སེམས་ཅན་ཀུན་གྱི་ཆོས་ཀྱི་མིག ། རྣམ་པར་དག་པར་བྱེད་གྱུར་ཅིག །
en: May I awaken to unsurpassed buddhahood And cause all beings To purify the eye of Dharma!

source: མིག་བྱིན་བརྟུལ་ཞུགས་བཟང་པོ་དེས། དྲི་མ་མེད་ཅིང་སྐྱོན་མེད་ལ། །དག་ཅིང་ཡངས་ལ་མཛེས་བཟངས་དང་། །ཞི་བའི་མིག་ནི་ཐོབ་པར་འགྱུར། །
en: “Through the excellent practice Of offering one’s eyes, One will attain spotless, immaculate, Pure, wide, magnificent, and peaceful eyes.

source: ཨུཏ་པལ་སྔོན་པོའི་འདབ་འདྲ་དང་། །བྱིའུ་ཀུ་ན་ལའི་མིག་འདྲ་ཞིང་། །མིག་གི་རྫི་མ་བ་ཡི་འདྲ། །དེ་འདྲའི་མིག་ནི་དེ་ཡིས་འཐོབ། །
en: “That person will have beautiful eyes, Similar to the petals of blue lotus flowers Or the eyes of the kuṇāla bird, With eyelashes like those of a cow.

source: དེ་ལ་མགོ་བོ་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་ལ་ཇི་ལྟར་མངོན་པར་བརྩོན་པར་བྱེད་ཅེ་ན།
en: “How do bodhisattvas exert themselves in the practice of generosity by giving away their heads?

source: མགོ་བོ་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་ཞེས་བྱ་བ་དེ་ནི། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཁམས་གསུམ་ཐམས་ཅད་ལས་ཁྱད་པར་དུ་འཕགས་པའི་མཆོག་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་འཐོབ་པའི་ཚིག་བླ་དགས་ཡིན་གྱིས།
en: ‘Giving away one’s head represents the bodhisattvas’ attainment of omniscient wisdom, the supreme state that is more exalted than the entirety of the three realms. Therefore,

source: བདག་གིས་མགོ་བོ་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་སྦྱིན་པར་བྱ་གོར་མ་ཆག་སྙམ་མོ། །
en: I will definitely practice generosity by giving away my head!’

source: དེ་མགོ་བོ་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་དེ་སྦྱིན་པ་ན།
en: When practicing generosity by giving away their heads,

source: དེ་བཞིན་གཤེགས་པའི་རྐྱེན་དུ་བབ་པའི་སྨོན་ལམ་བཞིན་དུ་མགོ་བོ་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་འདིས་ན།
en: ‘In accordance with the benevolent aspirations of the thus-gone ones, through this gift of my head,

source: བདག་སེམས་ཅན་ཐམས་ཅད་འཇིག་རྟེན་གསུམ་ལས་ཁྱད་པར་དུ་འཕགས་པའི་མཆོག་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཐོབ་པར་བྱེད་པར་གྱུར་ཅིག་
en: may I cause all beings to attain omniscient wisdom, the supreme state that is more exalted than the entirety of the three realms!’

source: མགོ་བོ་ཡོངས་སུ་གཏོང་བ་ཡིས། །བསོད་ནམས་བདག་ལ་ཅི་ཡོད་པ། །དེས་ན་སེམས་ཅན་ཀུན་མཁྱེན་གྱི། །གོ་འཕང་མི་གཡོ་ཐོབ་གྱུར་ཅིག །
en: “Through all the merit that I have accumulated By giving away my head, May all beings attain The unwavering state of omniscience!

source: དེ་ལ་པགས་ཤུན་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་ལ་ཇི་ལྟར་མངོན་པར་བརྩོན་པར་བྱེད་ཅེ་ན།
en: “How do bodhisattvas exert themselves in the practice of generosity by giving away their skin?

source: པགས་ཤུན་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་ཞེས་བྱ་བ་དེ་ནི། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་པགས་པ་འཇམ་ཞིང་སྲབ་ལ་གསེར་གྱི་མདོག་ལྟ་བུ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བའི་ཚིག་བླ་དགས་ཡིན་གྱིས།
en: ‘Giving away one’s skin represents the bodhisattvas’ perfection of smooth, fine, and golden skin. Therefore,

source: བདག་གིས་པགས་ཤུན་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་སྦྱིན་པར་བྱ་གོར་མ་ཆག་སྙམ་མོ། །
en: I will definitely practice generosity by giving away my skin!’

source: དེ་པགས་ཤུན་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་དེ་སྦྱིན་པ་ན།
en: When practicing generosity by giving away their skin,

source: དེ་བཞིན་གཤེགས་པའི་སྨོན་ལམ་བཞིན་དུ། པགས་ཤུན་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་འདིས་ན།
en: ‘In accordance with the aspirations of the thus-gone ones, through this gift of my skin

source: བདག་སེམས་ཅན་ཐམས་ཅད་ཀྱི་པགས་པ་འཇམ་ཞིང་སྲབ་ལ། གསེར་གྱི་ཁ་དོག་ལྟ་བུ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པར་གྱུར་ཅིག་
en: may I cause all beings to achieve smooth, fine, and golden skin!’

source: པགས་ཤུན་ཡོངས་སུ་བཏང་བ་ཡིས། །བདག་གིས་སུ་ནི་ལུས་ཅན་རྣམས། །པགས་ཤུན་ལུས་ལས་སྐྱེས་པ་དག །འཇམ་སྲབ་གསེར་གྱི་མདོག་སྒྱུར་ཤོག །
en: “May this gift of my skin Transform the skin that covers The bodies of all beings Into smooth, fine, and golden skin!

source: དེ་ལ་ཤ་དང་ཁྲག་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་ལ་ཇི་ལྟར་མངོན་པར་བརྩོན་པར་བྱེད་ཅེ་ན།
en: “How do bodhisattvas exert themselves in the practice of generosity by giving away their flesh and blood?

source: ཤ་དང་ཁྲག་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་ཞེས་བྱ་བ་དེ་ནི། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྙིང་པོ་མེད་པ་ཐམས་ཅད་ལས་སྙིང་པོ་བླང་བའི་ཚིག་བླ་དགས་ཡིན་གྱིས།
en: ‘Giving away one’s flesh and blood represents the bodhisattvas’ extraction of substance from all that lacks substance. Therefore,

source: བདག་གིས་ཤ་དང་ཁྲག་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་སྦྱིན་པར་བྱ་གོར་མ་ཆག་སྙམ་མོ། །
en: I will definitely practice generosity by giving away my flesh and blood!’

source: དེ་ཤ་དང་ཁྲག་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་དེ་སྦྱིན་པ་ན།
en: When practicing generosity by giving away their flesh and blood,

source: དེ་བཞིན་གཤེགས་པས་བསྐྱེད་པའི་སྨོན་ལམ་བཞིན་དུ། ཤ་དང་ཁྲག་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་འདིས་ན་
en: ‘In accordance with the aspirations made by the thus-gone ones, through the gift of my flesh and blood,

source: བདག་གིས་སེམས་ཅན་ཐམས་ཅད་སྙིང་པོ་མེད་པ་ཐམས་ཅད་ལས་སྙིང་པོ་ལེན་དུ་འཇུག་པར་བྱེད་པར་གྱུར་ཅིག་
en: may I cause all beings to extract substance from all that lacks substance!’

source: ཤ་དང་ཁྲག་གི་སྦྱིན་པ་ཡི། །རྣམ་སྨིན་བདག་ལ་ཅི་ཡོད་དེས། །སྙིང་པོ་མེད་པ་མ་ལུས་ལས། །འགྲོ་ཀུན་སྙིང་པོར་ཐོབ་གྱུར་ཅིག །
en: “Through the karmic ripening Brought about by offering my flesh and blood, May all beings attain what is substantial From all that lacks substance.

source: དེ་ལ་རྐང་སྦྱིན་པ་ལ་ཇི་ལྟར་མངོན་པར་བརྩོན་པར་བྱེད་ཅེ་ན།
en: “How do bodhisattvas exert themselves in the practice of generosity by offering the marrow of their bones?

source: རྐང་སྦྱིན་པ་ཞེས་བྱ་བ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལུས་རྡོ་རྗེ་ལྟར་མི་ཤིགས་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བའི་ཚིག་བླ་དགས་ཡིན་གྱིས་
en: ‘Offering the marrow of one’s bones represents the bodhisattvas’ completion of the indestructible vajra-like body.

source: བདག་གིས་རྐང་གི་སྦྱིན་པ་སྦྱིན་པར་བྱ་གོར་མ་ཆག་སྙམ་མོ། །
en: Therefore, I will definitely practice generosity by offering the marrow of my bones!’

source: དེ་རྐང་གི་སྦྱིན་པ་དེ་སྦྱིན་པ་ན།
en: When practicing generosity by offering the marrow of their bones,

source: དེ་བཞིན་གཤེགས་པས་བསྐྱེད་པའི་སྨོན་ལམ་བཞིན་དུ། རྐང་གི་སྦྱིན་པ་འདིས་ན།
en: ‘In accordance with the aspirations formed by the thus-gone ones, through this offering of the marrow of my bones

source: བདག་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་རྡོ་རྗེ་ལྟར་མི་ཤིགས་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པར་གྱུར་ཅིག་
en: may I cause all beings to achieve the indestructible vajra-like body!’

source: རྐང་གི་སྦྱིན་པ་འདི་ཡིས་ན། །བདག་གིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི། །རྣག་གི་ལུས་ཀྱི་ཟ་མ་ཏོག །རྡོ་རྗེ་མི་ཤིགས་རྫོགས་བྱེད་ཤོག །
en: “Through this offering of the marrow of my bones, May I cause all beings To perfect their bodies, vessels of pus, As indestructible vajra!

source: གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: “Furthermore, bodhisattvas also think,

source: ཁ་དོག་ཕུན་སུམ་ཚོགས་པ་བྱིན་པས་ནི། ཁ་དོག་དང་ལྡན་པར་འགྱུར་གྱིས་བདག་གིས་ཁ་དོག་ཕུན་སུམ་ཚོགས་པ་སྦྱིན་པར་བྱ་གོར་མ་ཆག་སྙམ་སེམས་
en: ‘By offering excellent colors, one will attain a beautiful complexion, so I will definitely offer excellent colors!

source: ཤིང་དྲི་ཕུན་སུམ་ཚོགས་པ་བྱིན་པས་ནི་གྲགས་པའི་དྲི་དང་ལྡན་པར་འགྱུར།
en: By offering excellent smells, one will develop the scent of renown.

source: རོ་བྲོ་བ་ཕུན་སུམ་ཚོགས་པ་བྱིན་པས་ནི་ཡོ་བྱད་གྱ་ནོམ་པ་རྣམས་འཐོབ་པར་འགྱུར།
en: By offering excellent flavors, one will gain excellent provisions.

source: རེག་པ་ཕུན་སུམ་ཚོགས་པ་བྱིན་པས་ནི་རྐ་ལག་འཇམ་ལ་གཞོན་ཤ་ཆགས་པར་འགྱུར།
en: By offering fine textures, one’s limbs will become smooth and tender.

source: རང་གི་ལག་ནས་བྱིན་པས་ནི་བསྙེན་བཀུར་བྱེད་པ་འཐོབ་པར་འགྱུར།
en: By offering one’s hands, one will gain respect.

source: གུས་པར་བྱས་ཏེ་བྱིན་པས་ནི་གཉེན་ལ་སོགས་པའི་ནང་དུ་གཞན་གྱིས་བཀུར་སྟི་བྱ་བར་འགྱུར།
en: By making offerings with devotion, one will be revered by one’s relatives.

source: དུས་སུ་བྱིན་པས་ནི་དེའི་ནོར་རྣམས་དུས་སུ་འགྲུབ་ཅིང་རྒྱས་པར་འགྱུར།
en: By making timely offerings, one will gain wealth and prosper in a timely way.

source: འཐུན་པ་དང་ཡིད་དུ་འོང་བ་བྱིན་པས་ནི་མལ་དང་གོས་ལ་སོགས་པ་ལོངས་སྤྱོད་ཡིད་དུ་འོང་བ་རྣམས་ལ་སེམས་འཇུག་པར་འགྱུར།
en: By offering what is suitable and pleasant, one will enjoy pleasant possessions such as beds and clothes.

source: གཞན་ལ་མི་གནོད་པར་བྱིན་པས་ནི་ལོངས་སྤྱོད་བརྟན་པ་དག་འཐོབ་པར་འགྱུར།
en: By practicing the generosity that is free of harming others, one will gain stable enjoyments.

source: མི་དགའ་བ་དང་དུ་ལེན་པའི་སྦྱིན་པས་ནི་འཁོར་སྙིང་ཉེ་བར་འགྱུར།
en: By practicing the generosity of undertaking what is unpleasant, one’s entourage will be intimate.

source: ཟས་བྱིན་པས་ནི་སྟོབས་དང་ལྡན་པར་འགྱུར།
en: By offering food, one will become strong.

source: སྐོམ་བྱིན་པས་ནི་སྐོམ་པ་མེད་པར་འགྱུར།
en: By offering beverages, one will not thirst.

source: གོས་བྱིན་པས་ནི་ཁ་དོག་དང་ལྡན་པར་འགྱུར།
en: By offering clothes, one will gain a beautiful complexion.

source: མར་མེ་བྱིན་པས་ནི་མིག་དང་ལྡན་པར་འགྱུར།
en: By offering lamps, one will develop excellent vision.

source: རོལ་མོའི་སྒྲ་བྱིན་པས་ནི་རྣ་བ་ཉམས་པ་མེད་པར་འགྱུར།
en: By offering music, one will have good hearing.

source: བཞོན་པ་བྱིན་པས་ནི་བདེ་བ་དང་ལྡན་པར་འགྱུར།
en: By offering vehicles, one will be happy.

source: སྨན་བྱིན་པས་ནི་ནད་ཉུང་བར་འགྱུར།
en: By offering medicine, one will be affected by few illnesses.

source: མེ་ཏོག་བྱིན་པས་ནི་གཞན་གྱིས་མཆོད་པར་འགྱུར།
en: By offering flowers, one will be worshiped by others.

source: མེ་ཏོག་ཕྲེང་བྱིན་པས་ནི་གཞན་གྱིས་རིམ་གྲོ་བྱ་བར་འགྱུར།
en: By offering flower garlands, one will be revered by others.

source: བསྟོད་པ་བྱིན་པས་ནི་ཚངས་པའི་དབྱངས་དང་ལྡན་པར་འགྱུར།
en: By offering praises, one will be endowed with the voice of Brahmā.

source: སྟན་བྱིན་པས་ནི་བླ་མའི་གནས་ཐོབ་པར་འགྱུར།
en: By offering seats, one will attain important positions.

source: བཞོན་པ་བྱིན་པས་ནི་རྫུ་འཕྲུལ་དང་ལྡན་པར་འགྱུར།
en: By offering vehicles, one will gain miraculous powers.

source: བྱུག་པ་བྱིན་པས་ནི་རྨ་མེད་པར་འགྱུར།
en: By offering ointments, one will be free of wounds.

source: ཕྱག་དར་བྱ་བ་བྱིན་པས་ནི་རྡུལ་དང་བྲལ་བར་འགྱུར།
en: By the gift of sweeping, one will be free of dirt.

source: དྲིལ་བུ་བྱིན་པས་ནི་ཚེ་རབས་དྲན་པར་འགྱུར།
en: By offering bells, one will be able to recollect former lives.

source: གནས་བྱིན་པས་ནི་ཐམས་ཅད་བྱིན་པར་འགྱུར།
en: By offering residences, everything will be offered.

source: ཆོས་བྱིན་པས་ནི་བདུད་རྩི་བྱིན་པར་འགྱུར་གྱིས་
en: By offering the Dharma, ambrosia will be offered.

source: བདག་གིས་ཆོས་ཀྱི་སྦྱིན་པ་སྦྱིན་པར་བྱ་གོར་མ་ཆག་སྙམ་མོ། །
en: Therefore, I will definitely practice generosity by offering the Dharma!

source: དེ་སྦྱིན་པ་དེ་ལྟ་བུ་སྦྱིན་པ་ན་ཆགས་པས་སྦྱིན་པར་མི་བྱེད།
en: “When bodhisattvas practice generosity by making such offerings, they do not do so out of attachment,

source: སྡང་བས་སྦྱིན་པར་མི་བྱེད།
en: they do not do so out of [...] aversion,

source: རྨོངས་པས་སྦྱིན་པར་མི་བྱེད།
en: they do not do so out of [...] delusion,

source: ཚིག་པ་ཟ་ཞིང་སྦྱིན་པར་མི་བྱེད།
en: they do not do so out of [...] irritation,

source: བརྙས་བཞིན་དུ་སྦྱིན་པར་མི་བྱེད།
en: they do not do so out of [...] contempt,

source: རྡེག་ཅིང་སྦྱིན་པར་མི་བྱེད།
en: they do not do so out of [...] violence,

source: ཚར་བཅད་དེ་སྦྱིན་པར་མི་བྱེད།
en: they do not do so out of [...] deprecation,

source: ཁྱད་དུ་གསོད་ཅིང་སྦྱིན་པར་མི་བྱེད།
en: they do not do so out of [...] disrespect,

source: སྨད་དེ་སྦྱིན་པར་མི་བྱེད།
en: they do not do so out of [...] reproach,

source: ང་རྒྱལ་གྱིས་ཁེངས་བཞིན་དུ་སྦྱིན་པར་མི་བྱེད།
en: they do not do so out of [...] pride,

source: འགྱིང་བཞིན་དུ་སྦྱིན་པར་མི་བྱེད།
en: they do not do so out of [...] or haughtiness.

source: ལྷག་མར་གྱུར་པ་སྦྱིན་པར་མི་བྱེད།
en: They never offer leftovers

source: རུལ་ཅིང་མྱགས་པ་སྦྱིན་པར་མི་བྱེད་ཀྱི་
en: They never offer [leftovers] or anything rotten or decaying.

source: སྦྱིན་པ་གང་དང་གང་སྦྱིན་པ་དེ་གུས་པར་བྱས་ཏེ་སྦྱིན་པར་བྱེད། བླ་མར་བྱས། རི་མོ་བྱས། མཆོད་པ་བྱས་ཤིང་བརྗོད་ནས་སྦྱིན་པར་བྱེད།
en: Instead, they present all their offerings respectfully, always expressing an attitude of respect, reverence, and worship.

source: མང་དུ་སྦྱིན་པར་བྱེད། བཟང་པོ་སྦྱིན་པར་བྱེད། རབ་ཏུ་དགའ་བས་སྦྱིན་པར་བྱེད། དགའ་ཞིང་མགུ་བས་སྦྱིན་པར་བྱེད།
en: They offer large quantities of excellent gifts with delight, joy, and elation.

source: གཙང་བ་དང་། རྒྱ་ཆེར་སྦྱིན་པར་བྱེད།
en: What they offer is pure, and they offer it on a vast scale.

source: རང་གི་ལག་ནས་སྦྱིན་པར་བྱེད་གུས་པ་དང་བཅས་པ་དང་། ཞེ་ས་དང་བཅས་པས་སྦྱིན་པར་བྱེད།
en: They make offerings from their own hands with respect and reverence,

source: བསམ་པ་དག་ཅིང་བཟང་ལ་དགེ་བས་སྦྱིན་པར་བྱེད།
en: They make offerings [from their own hands with respect and reverence,] and their motivation is pure, wholesome, and virtuous.

source: སེར་སྣ་མེད་པར་སྦྱིན་པར་བྱེད། བརྐམ་པ་མེད་པར་སྦྱིན་པར་བྱེད། ཞུམ་པ་མེད་པར་སྦྱིན་པར་བྱེད། འཇིགས་པ་མེད་པར་སྦྱིན་པར་བྱེད། རྒྱ་ཆེ་ཞིང་ཡངས་པར་སྦྱིན་པར་བྱེད་དོ། །
en: They make offerings without any sense of miserliness, greed, discouragement, or fear, and their offerings are vast and extensive.

source: དེ་སྦྱིན་པ་དེ་ལྟ་བུ་དེ་སྦྱིན་པ་ན་
en: “When they practice generosity by making such offerings,

source: འདི་སྙམ་དུ་འདི་ནི་ཚུལ་ཁྲིམས་དང་ལྡན་པ་ཡིན་གྱིས། བདག་གིས་སྦྱིན་པར་བྱའོ། །
en: by thinking, ‘This person is disciplined, so I will be generous to them

source: འདི་ནི་ཚུལ་ཁྲིམས་འཆལ་པ་ཡིན་ནོ། །
en: —but that one has flawed discipline.

source: འདི་ནི་དགེ་བའི་ཆོས་དང་ལྡན་པ་ཡིན་ནོ། །འདི་ནི་དགེ་བའི་ཆོས་མ་ཡིན་པ་དང་ལྡན་པ་ཡིན་ནོ། །
en: This person is virtuous, but that one is not.

source: འདི་ལ་བྱིན་ན་ནི་འབྲས་བུ་ཆེ་བ་དང་། ཕན་ཡོན་ཆེ་བ་དང་། མཐུ་ཆེ་བར་འགྱུར་རོ། །འདི་ལ་བྱིན་ན་ནི་འབྲས་བུ་མི་ཆེ་བ་དང་། ཕན་ཡོན་མི་ཆེ་བ་དང་། མཐུ་མི་ཆེ་བར་འགྱུར་རོ་
en: Being generous to this person will generate great results, great benefits, and great profits, but being generous to that one will not.’

source: སྙམ་དུ་མི་སེམས་སོ། །
en: they never discriminate

source: གཞན་ཡང་ཡང་དག་པའི་བློ་དང་ལྡན་གྱི་ཡང་དག་པ་མ་ཡིན་པ་མ་ཡིན་པའི་ཕྱིར་དེ་སྦྱིན་པ་དེ་སྦྱིན་པ་ན།
en: “Furthermore, since their attitude is correct and free of mistakes, when bodhisattvas practice generosity

source: འདི་སྙམ་དུ་སྦྱིན་པ་འདི་དང་དགེ་བའི་རྩ་བ་དང་། ཆོས་ཀྱི་སྦྱིན་པ་དེ་ཡོངས་སུ་གཏོང་བ་འདིས་ན་བདག་རྒྱལ་པོར་གྱུར་ཅིག་ཅེའམ། རྒྱལ་པོ་གཞན་ནམ། བློན་པོ་ཆེན་པོའམ། ལྷའམ། ཀླུའམ། ལྷའི་བུའམ། ལྷ་གཞན་གང་ཡང་རུང་བ་ཞིག་ཏུ་གྱུར་ཅིག་ཅེས་སེམས་སྐྱེད་པར་མི་བྱེད་དོ། །
en: they never think, ‘Through this gift, these roots of virtue, and this offering of the Dharma may I become a king, a ruler, a minister, a god, a nāga, a divine son, or any other type of divine being!’

source: འོ་ན་གང་དུ་ཞེ་ན།
en: Instead, what do bodhisattvas wish for?

source: གཞན་དུ་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བར་བྱེད་དེ།
en: They dedicate their merit to unsurpassed and perfect awakening.

source: དགེ་བའི་རྩ་བ་འདི་དང་ཆོས་ཀྱི་ཕྱིར་ཡོངས་སུ་གཏོང་བ་འདིས་ན།
en: They think, ‘Through these roots of virtue and this offering of the Dharma,

source: བདག་སེམས་ཅན་མ་རྒལ་བ་རྣམས་སྒྲོལ་བ་དང་། མ་གྲོལ་བ་རྣམས་དགྲོལ་བར་བྱེད་པ་དང་།
en: may I free all beings who have not crossed over to the other shore, and may I liberate all those who are not yet liberated.

source: དབུགས་མ་ཕྱིན་པ་རྣམས་དབུགས་འབྱིན་པ་དང་།
en: May I provide relief to all those who have not found relief.

source: ཡོངས་སུ་མྱ་ངན་ལས་མ་འདས་པ་རྣམས་ཡོངས་སུ་མྱ་ངན་ལས་ཟློ་བར་བྱེད་པ་དང་།
en: May I lead beyond suffering all those who have not transcended suffering, and

source: འཇིག་རྟེན་ལོང་བ་འདྲེན་པ་མེད་པ་དང་། སྐྱོ་བ་མེད་པ་དང་། སྐྱབས་མེད་པ་དང་། གནས་མེད་པ་དང་། གླིང་མེད་པ་དང་། དཔུང་གཉེན་མེད་པ་རྣམས་ཀྱི་འདྲེན་པ་དང་། ཡོངས་སུ་འདྲེན་པ་དང་། སྒྲོལ་བ་དང་། སྐྱབས་དང་། གནས་དང་། གླིང་དང་། དཔུང་གཉེན་དུ་གྱུར་ཅིག་
en: may I be a guide, a leader, a liberator, a refuge, a shelter, a support, and an assistant for those worldly beings who are blind and lack a guide, a protector, refuge, shelter, support, and assistance!’

source: ཆོས་ཕྱིར་སྦྱིན་པ་འདིས་ན་བདག །འཁོར་བ་ཡི་ནི་རྒྱ་མཚོ་ལས། །གཞན་མིན་ཐེག་པ་ཆེན་པོ་ཡིས། །སེམས་ཅན་རྣམས་ནི་སྒྲོལ་གྱུར་ཅིག །
en: “Through this offering of the Dharma, May I liberate all beings From the ocean of cyclic existence Through the sole path of the Great Vehicle!

source: སྐྱེ་བོ་ཐམས་ཅད་ཉོན་མོངས་པའི། །འཆིང་བ་དག་ལས་འགྲོལ་བར་ཤོག །
en: “May I release all beings From the fetters of their afflictions!

source: དབུགས་མ་ཕྱིན་པ་དབུགས་འབྱིན་ཅིང་། །མྱ་ངན་འདས་ལམ་སྟོན་གྱུར་ཅིག །
en: May I provide relief to those who have not found relief And guide them on the path to the transcendence of suffering!

source: འཇིག་རྟེན་ལོང་བ་འདྲེན་མེད་པའི། །ཡོངས་སུ་འདྲེན་པར་བདག་གྱུར་ཅིག །
en: “May I be a leader for those worldly beings Who are blind and have no guide!

source: ལུས་ཅན་རྣམས་ལ་སྐྱོབ་པ་དང་། །དཔུང་གཉེན་གླིང་དང་སྐྱབས་གྱུར་ཅིག །
en: May I be a protector, an assistant, A support, and a refuge for all beings!

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་མངོན་པར་བརྩོན་པར་བྱེད་པ་ཡིན་ནོ། །
en: “Noble son, this is how bodhisattva great beings exert themselves in the perfection of generosity.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རིའི་ཕུག་དང་། ཟོམ་དང་། རི་སུལ་དང་། གསེབ་དང་། སྨན་ལྗོངས་ན་སེང་གེའི་མཆོག་རྣམ་པར་བསྒྱིངས་ཤིང་ང་རོ་རྣམ་པར་སྒྲོགས་པ་ལྟ་བུའི་མིའི་དབང་པོའི་གཙུག་གི་ནོར་བུས། བཅོམ་ལྡན་འདས་ལས་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་དབྱེ་བ་བཤད་པ་ཐོས་ནས་
en: When the bodhisattva great being Crown Jewel of the Lord of Men Resembling a Sublime Lion Sporting and Roaring in Mountain Caves, Peaks, Clefts, Valleys, and Meadows heard the Blessed One’s detailed exposition on the perfection of generosity,

source: ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཏེ།
en: he felt satisfied, delighted, and elated.

source: རབ་ཏུ་དགའ་ཞིང་བདེ་བ་དང་། ཡིད་བདེ་བ་སྐྱེས་ནས་སྟན་ལས་ལངས་ཏེ།
en: Thrilled, happy, and ecstatic, he stood up,

source: བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་པད་མའི་སྙིང་པོ་ལ་བཙུགས་ཏེ།
en: draped his shawl over one shoulder, and knelt with his right knee on the calyx of a lotus flower.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས།
en: With his palms joined together, he bowed down toward the Blessed One and

source: བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ལེགས་སོ་ཞེས་བྱ་བ་གསོལ་ཏོ། །
en: applauded him by chanting these verses:

source: སྦྱིན་མཛད་ལེགས་སོ་རྟག་ཏུ་ཡབ་འདྲ་ཁྱོད་ལེགས་སོ། །
en: “Benefactor, this is excellent! You who are always like a father, this is excellent!

source: སྦྱིན་མཛད་ལེགས་སོ་གསང་མཛད་བདེ་གཤེགས་ཁྱོད་ལེགས་སོ། །
en: Benefactor, this is excellent! Blissful One, your words are excellent!

source: གཉེན་གྱུར་ལེགས་སོ་མཛའ་བོ་སྟོན་པར་གྱུར་པ་ལེགས། །
en: Friend, this is excellent! Beloved teacher, this is excellent!

source: གཅིག་པུ་འདི་ན་དམྱལ་བ་སྐྱོབ་པ་ཁྱོད་ལེགས་སོ། །
en: Sole protector of hell beings, this is excellent!

source: ཐུ་བོ་ལེགས་སོ་ལྷ་མི་རྣམས་ནང་བགྲེས་པ་ལེགས། །
en: “Excellent leader, this is excellent! Chief of gods and humans, this is excellent!

source: མཆོད་གནས་ལེགས་སོ་མི་རྣམས་ནང་ན་དཔའ་བོ་ལེགས། །
en: Venerable one, this is excellent! Hero among humans, this is excellent!

source: གསུངས་པ་ལེགས་སོ་བདག་ཉིད་ཆེན་པོ་རབ་ཏུ་ལེགས། །
en: Your words are excellent! Great being, this is utterly excellent!

source: མི་རྣམས་ཉོན་མོངས་དུག་སེལ་སྨན་པའི་རྒྱལ་པོ་ལེགས། །
en: King of healers who dispels the poison of humans’ afflictions, this is excellent!

source: གྲོལ་བ་ལེགས་སོ་སྲིད་པ་གསུམ་ལས་རྣམ་གྲོལ་ལེགས། །
en: “Liberated being, this is excellent! One freed from the three existences, this is excellent!

source: སྨན་པ་ལེགས་སོ་ཕན་བཞེད་དམ་པ་སྦྱིན་མཛད་ལེགས། །
en: Physician, this is excellent! Generous and sublime aide, this is excellent!

source: དཔལ་ཡོན་ཅན་ལེགས་བཀྲ་ཤིས་སྙོམས་པའི་ཐུགས་མངའ་ལེགས། །
en: Glorious being, this is excellent! Auspicious and impartial one, this is excellent!

source: སྐལ་ལྡན་ཟླ་བ་ཉི་འདྲ་དྲི་མེད་ཞལ་མངའ་ལེགས། །
en: Fortunate one with a pure face like the sun and moon, this is excellent!

source: བློ་ལྡན་མཐོན་མཐིང་སྤྱན་ཡངས་རིང་བ་ལེགས། །
en: “Wise one with long and wide sapphire eyes, this is excellent!
